coocox/Mplib/Toshaba/TMPM36x/TMPM363/cmsis_lib/lib/source/tmpm363_can.c
    /* Mailbox Tx order, ID:CANMCR<MTOS>=1, mailbox number:CANMCR<MTOS>=0 */
    tmp = TSB_CAN->MCR;
    tmp = (TxOrder == CAN_TX_ORDER_ID) ? (tmp | MCR_MTOS_SET) : (tmp & MCR_MTOS_CLEAR);
    tmp &= MCR_TSBTEST_CLEAR;
    TSB_CAN->MCR = tmp;
}

/**
  * @brief  Clear time stamp counter.
  * @param  None.
  * @retval None.
  */
void CAN_ClearTimeStampCnt(void)
{
    uint32_t tmp = 0U;
    /* Set CANMCR<TSCC> */
    tmp = TSB_CAN->MCR;
    tmp |= MCR_TSCC_SET;
    tmp &= MCR_TSBTEST_CLEAR;
    TSB_CAN->MCR = tmp;
}

/**
  * @brief  Software reset of the module(all parameters will reset to their initial values).
  * @param  None.
  * @retval None.
  */
void CAN_SWReset(void)
{
    uint32_t tmp = 0U;
    /* Set CANMCR<SRES> */
    tmp = TSB_CAN->MCR;
    tmp |= MCR_SRES_SET;
    tmp &= MCR_TSBTEST_CLEAR;
    TSB_CAN->MCR = tmp;
}

/**
  * @brief  Configure the bit timing and sampling parameters.
  * @param  BitTimingStruct: The structure used to specify the baud rate 
  *         prescaler, bit timing parameter Sjw, Tseg1, Tseg2
  *         and sampling method.
  * @retval None.
  */
void CAN_ConfigBitTiming(CAN_BitTimingTypeDef * BitTimingStruct)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(BitTimingStruct));
    assert_param(IS_CAN_TIMING_BRP(BitTimingStruct->Brp));
    assert_param(IS_CAN_TIMING_SJW(BitTimingStruct->Sjw));
    assert_param(IS_CAN_SAMPLING_MODE(BitTimingStruct->Sam));
    assert_param(IS_CAN_TIMING_TSEG1(BitTimingStruct->Tseg1));
    assert_param(IS_CAN_TIMING_TSEG2(BitTimingStruct->Tseg2));
    assert_param(IS_CAN_TIMING_CHECK
                 (BitTimingStruct->Sjw, BitTimingStruct->Tseg1, BitTimingStruct->Tseg2));

    if (BitTimingStruct->Brp == 0U) {
        assert_param(IS_CAN_TIMING_BRP0_TSEG2(BitTimingStruct->Tseg2));
        assert_param(IS_CAN_SAMPLING_SINGLE_MODE(BitTimingStruct->Sam));
    } else {
        if (BitTimingStruct->Brp < 4U) {
            assert_param(IS_CAN_SAMPLING_SINGLE_MODE(BitTimingStruct->Sam));
        } else {
            /* Do nothing */
        }
    }

    /* Set baud rate prescaler CANBCR1<BRP> */
    tmp = (uint32_t) BitTimingStruct->Brp;
    TSB_CAN->BCR1 = tmp;
    /* Set bit timing parameters CANBCR2<SJW,TSEG2,TSEG1> */
    tmp = 0U;
    tmp |= (uint32_t) BitTimingStruct->Tseg1 |
        ((uint32_t) BitTimingStruct->Tseg2 << 4U) | ((uint32_t) BitTimingStruct->Sjw << 8U);
    /* Set sampling method, single sampling:CANBCR2<SAM>=0, triple sampling:CANBCR2<SAM>=1 */
    tmp = (BitTimingStruct->Sam ==
           CAN_TRIPLE_SAMPLING) ? (tmp | BCR2_SAM_SET) : (tmp & BCR2_SAM_CLEAR);

    TSB_CAN->BCR2 = tmp;
}

/**
  * @brief  Set time stamp counter value and prescaler.
  * @param  CntValue: 16-bits time stamp counter value.
  * @param  Prescaler: Time stamp counter prescaler, and 
  *         this value should be equal or less than 0xF.
  * @retval None.
  */
void CAN_SetTimeStampCnt(uint16_t CntValue, uint8_t Prescaler)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_CAN_TIME_STAMP_PRESCALER(Prescaler));

    /* Set time stamp counter prescaler CANTSP<TSP> */
    tmp = (uint32_t) Prescaler;
    TSB_CAN->TSP = tmp;
    /* Set time stamp counter CANTSC<TSC> */
    tmp = (uint32_t) CntValue;
    TSB_CAN->TSC = tmp;
}

/**
  * @brief  Get the transmission/receiving error counter value.
  * @param  TxErrCnt: The pointer to store transmission error counter value.
  * @param  RxErrCnt: The pointer to store receiving error counter value.
  * @retval None.
  */
void CAN_GetErrCnt(uint8_t * TxErrCnt, uint8_t * RxErrCnt)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(TxErrCnt));
    assert_param(IS_POINTER_NOT_NULL(RxErrCnt));

    tmp = TSB_CAN->CEC;
    /* Get Tx error counter CANCEC<TEC> */
    *TxErrCnt = (uint8_t) (tmp >> 8U);
    /* Get Rx error counter CANCEC<REC> */
    *RxErrCnt = (uint8_t) tmp;
}

/**
  * @brief  Set the transmission/receiving error counter value in test error mode.
  * @param  TRxErrCnt: The value to set transmission error counter and receiving error counter, 
  *         these two counters should be set the same value at the same time in test error mode.
  * @retval None.
  */
void CAN_SetErrCnt(uint8_t TRxErrCnt)
{
    uint32_t tmp = 0U;

    /* Set TRx error counter CANCEC<TEC,REC> */
    tmp = (uint32_t) TRxErrCnt | ((uint32_t) (TRxErrCnt) << 8U);
    TSB_CAN->CEC = tmp;
}

/**
  * @brief  Get the global state flag of the module.
  * @param  None.
  * @retval If the specified state happens, the bit will be set.
  */
CAN_GlobalState CAN_GetGlobalState(void)
{
    CAN_GlobalState retval = { 0U };

    /* Get global status CANGSR */
    retval.All = TSB_CAN->GSR;
    return retval;
}

/**
  * @brief  Get the global or mailbox interrupt flag.
  * @param  INTTypeID: Select the global, mailbox transmission/receiving 
  *         interrupt flag intended to get. This parameter can 
  *         be one of the following values:
  *         CAN_INT_TYPE_GLOBAL, CAN_INT_TYPE_TX, CAN_INT_TYPE_RX.
  * @retval The structure used to store interrupt flag. If the specified 
  *         interrupt happens, the flag will be set.
  */
CAN_INTFactor CAN_GetINTFlag(uint8_t INTTypeID)
{
    CAN_INTFactor retval = { 0U };

    /* Check the parameters */
    assert_param(IS_CAN_INT_TYPE_ID(INTTypeID));

    switch (INTTypeID) {
    case CAN_INT_TYPE_GLOBAL:
        /* Get global interrupt flag CANGIF */
        retval.All = TSB_CAN->GIF;
        retval.All &= GIF_INT_MASK;
        break;
    case CAN_INT_TYPE_TX:
        /* Get mailbox Tx interrupt flag CANMBTIF */
        retval.All = TSB_CAN->MBTIF;
        retval.All &= MBTIF_INT_MASK;
        break;
    case CAN_INT_TYPE_RX:
        /* Get mailbox Rx interrupt flag CANMBRIF */
        retval.All = TSB_CAN->MBRIF;
        break;
    default:
        /* Do nothing */
        break;
    }
    return retval;
}

/**
  * @brief  Clear the global or mailbox interrupt flag.
  * @param  INTTypeID: Select the global, mailbox transmission/receiving 
  *         interrupt flag intended to clear. This parameter can 
  *         be one of the following values:
  *         CAN_INT_TYPE_GLOBAL, CAN_INT_TYPE_TX, CAN_INT_TYPE_RX.
  * @retval None.
  */
void CAN_ClearINTFlag(uint8_t INTTypeID)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_CAN_INT_TYPE_ID(INTTypeID));

